# Introduction to Jupyter Notebooks: Problem Solving

In this notebook, we practice some common data analysis tasks.

## Import the Pandas Library

First, we import the Pandas library.

## Read the Spreadsheet into a DataFrame

Next, we read the spreadsheet into a DataFrame named `df`.

## Display the Contents of the DataFrame

Next, we display a summary of the contents of the DataFrame.

      Name  Exam1  Exam2
0      Bob     45     56
1    Alice     89     87
2     Jane     62     98
3     Rick     99    100
4    Perry    100    100
5    Louis     76     79
6     Mike     88     85
7    Romeo     88     80
8   Juliet     84     96
9    Wendy     96     93
10   Peter     98     88
11   Homer     91    100
12    Bart     55     34
13    Lisa     87     86
14   Marge     79     97

## Display an Individual Column in the DataFrame

Next, we display the Exam1 column of the DataFrame.

    Exam1
0      45
1      89
2      62
3      99
4     100
5      76
6      88
7      88
8      84
9      96
10     98
11     91
12     55
13     87
14     79

## Calculate the Average (Mean) Value of a Column in the DataFrame

Next, we calculate the average value in the Exam1 column.

Exam1    82.466667
dtype: float64

## Calculate the Average (Mean) Values of All Columns in the DataFrame

Next, we calculate the average value of each and every column in the DataFrame.

Exam1    82.466667
Exam2    85.266667
dtype: float64

## Display a Summary of Descriptive Statistics for Each Column in the DataFrame

Lastly, we calculate a variety of descriptive statistcs for each column of `df`.

            Exam1       Exam2
count   15.000000   15.000000
mean    82.466667   85.266667
std     16.552370   18.300924
min     45.000000   34.000000
25%     77.500000   82.500000
50%     88.000000   88.000000
75%     93.500000   97.500000
max    100.000000  100.000000